id: cissecurity_firewall_stealth_mode_enable
title: "Enable Firewall Stealth Mode"
discussion: |
  [discrete]
  ==== Description:
  While in Stealth mode the computer will not respond to unsolicited probes, dropping that traffic.
  
  http://support.apple.com/en-us/HT201642
  
  [discrete]
  ==== Rationale:
  Stealth mode on the firewall minimizes the threat of system discovery tools while connected to a network or the Internet.
  
  [IMPORTANT]
  ====
  Traditional network discovery tools like ping will not succeed. Other network tools that measure activity and approved applications will work as expected.
  This control aligns with the primary macOS use case of a laptop that is often connected to untrusted networks where host segregation may be non-existent. In that use case hiding from the other inmates is likely more than desirable. In use cases where use is only on trusted LANs with static IP addresses stealth mode may not be desirable.
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'EnableStealthMode = 1'  
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85428-1
  800-53r4:
    - SC-7
    - CM-7
    - SC-7(16)
  srg:
    - SRG-OS-000480-GPOS-00232
  cci:
    - CCI-000366
  disa_stig:
    - APPL-11-005050
  800-171r2:
    - 3.4.6
    - 3.13.1
    - 3.13.2
    - 3.13.5
  custom:
    CIS:
    - 2.5.2.3 Enable Firewall Stealth Mode (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableStealthMode: true