id: cissystempreferences_time_server_enforce
title: 'Enable "Set time and date automatically"'
discussion: |
  [discrete]
  ==== Description: 
  Correct date and time settings are required for authentication protocols, file creation, modification dates and log entries.

  [NOTE] 
  ====
  If your organization has internal time servers, enter them here. Enterprise mobile devices may need to use a mix of internal and external time servers. If multiple servers are required use the Date & Time System Preference with each server separated by a space.
  ====

  [discrete]
  ==== Rationale: 
  Kerberos may not operate correctly if the time on the Mac is off by more than 5 minutes. This in turn can affect Apple's single sign-on feature, Active Directory logons, and other features.
  
  [IMPORTANT]
  ====
  Apple's automatic time update solution will enable an NTP server that is not controlled by the Application Firewall. Turning on "Set time and date automatically" allows other computers to connect to set their time and allows for exploit attempts against ntpd. It also allows for more accurate network detection and OS fingerprinting

  Current testing shows scanners can easily determine the MAC address and the OS vendor. More extensive OS fingerprinting may be possible.
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'TMAutomaticTimeOnlyEnabled = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85449-7
  cci: 
    - CCI-001891
    - CCI-002046
  800-53r4: 
    - AU-8(1)
  srg: 
    - SRG-OS-000355-GPOS-00143
    - SRG-OS-000356-GPOS-00144
  disa_stig: 
    - APPL-11-000014
  800-171r2:
    - 3.3.7
  custom:
    CIS:
    - 2.2.1 Enable "Set time and date automatically" (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.timed:
      TMAutomaticTimeOnlyEnabled: true