id: cispwmanagement_screensaver_password_enforce
title: "Require a password to wake the computer from sleep or screen saver (Manual)"
discussion: |
  [discrete]
  ==== Description:
  Sleep and screensaver modes are low power modes that reduce electrical consumption while the system is not in use.

  [discrete]
  ==== Rationale:
  Prompting for a password when waking from sleep or screensaver mode mitigates the threat of an unauthorized person gaining access to a system in the user's absence.
  
  [IMPORTANT]
  ====
  Without a screenlock in place anyone with physical access to the computer would be logged in and able to use the active users session.
  ====

  [NOTE] 
  ====
  The command line check in previous versions of the Benchmark does not work as expected here. The use of a profile is recommended for both implementation and auditing on a 10.13 system.
  
  Issue 
  https://blog.kolide.com/screensaver-security-on-macos-10-13-is-broken-a385726e2ae2 
  
  Profile to control screensaver 
  https://github.com/rtrouton/profiles/blob/master/SetDefaultScreensaver/SetDefaultScreensaver.mobileconfig
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'askForPassword = 1'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85443-0
  cci: 
    - CCI-000056
  800-53r4: 
    - AC-11
  srg: 
    - SRG-OS-000028-GPOS-00009
  disa_stig: 
    - APPL-11-000002
  800-171r2:
    - 3.1.10
  custom:
    CIS:
    - 5.9 Require a password to wake the computer from sleep or screen saver (Manual)
    - Level 1
macOS:
  - "11.0"
tags:
  - 800-171
  - cnssi-1253
  - 800-53r4_moderate
  - 800-53r4_high
  - stig
  - CIS-Benchmark
  - CIS-Benchmark-L1  
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true
