id: cispwmanagement_password_age
title: "Password Age (Automated)"
discussion: |
  [discrete]
  ==== Description:
  Over time passwords can be captured by third parties through mistakes, phishing attacks, third party breaches or merely brute force attacks. To reduce the risk of exposure and to decrease the incentives of password reuse (passwords that are not forced to be changed periodically generally are not ever changed) users should reset passwords periodically. This control uses 365 days as the acceptable value, some organizations may be more or less restrictive. This control mainly exists to mitigate against password reuse of the macOS account password in other realms that may be more prone to compromise. Attackers take advantage of exposed information to attack other accounts.

  [discrete]
  ==== Rationale:
  Passwords should be changed periodically to reduce exposure
  
  [IMPORTANT]
  ====
  Required password changes will lead to some locked computers requiring admin assistance
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/awk -F " = " '/maxPINAgeInDays/{sub(/;.*/,"");print $2}'
result:
  integer: 365
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85400-0
  cci: 
    - CCI-000199
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000076-GPOS-00044
  disa_stig: 
    - APPL-11-003008
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  custom:
    CIS:
    - 5.2.7 Password Age (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: 365