id: cispwmanagement_special_character_enforce
title: "Complex passwords must contain a Special Character (Manual)"
discussion: |
  [discrete]
  ==== Description:
  Complex passwords contain one character from each of the following classes: English uppercase letters, English lowercase letters, Westernized Arabic numerals, and non- alphanumeric characters. Ensure that a special character is part of the password policy on the computer

  [discrete]
  ==== Rationale:
  The more complex a password the more resistant it will be against persons seeking unauthorized access to a system.
  
  [IMPORTANT]
  ====
  Password policy should be in effect to reduce the risk of exposed services being compromised easily through dictionary attacks or other social engineering attempts.
  ====

  [discrete]
  ==== Audit:
check: | 
  /usr/bin/profiles -P -o stdout | /usr/bin/awk '/minComplexChars/{sub(/;.*/,"");print $3}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85413-3
  cci: 
    - CCI-001619
  800-53r4: 
    - IA-5
    - IA-5(1)
  srg: 
    - SRG-OS-000266-GPOS-00101
  disa_stig: 
    - APPL-11-003011
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.7
    - 3.5.8
    - 3.5.9
    - 3.5.10
  custom:
    CIS:
    - 5.2.5 Complex passwords must contain a Special Character (Manual)
    - Level 2
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L2
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minComplexChars: 1
