id: cisuseraccounts_loginwindow_prompt_username_password_enforce
title: "Display login window as name and password (Automated)"
discussion: |
  [discrete]
  ==== Description:
  The login window prompts a user for his/her credentials, verifies their authorization level and then allows or denies the user access to the system.

  [discrete]
  ==== Rationale:
  Prompting the user to enter both their username and password makes it twice as hard for unauthorized users to gain access to the system since they must discover two attributes.

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'SHOWFULLNAME = 1'
result: 
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85435-6
  cci: 
    - N/A
  800-53r4: 
    - IA-2
  srg: 
    - SRG-OS-000480-GPOS-00229
  disa_stig: 
    - N/A
  800-171r2:
    - 3.5.1
    - 3.5.2
  custom:
    CIS:
    - 6.1.1 Display login window as name and password (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    SHOWFULLNAME: true
