id: useraccounts_guest_access_smb_disable
title: 'Disable "Allow guests to connect to shared folders" (Automated)'
discussion: |
  [discrete]
  ==== Description:
  Allowing guests to connect to shared folders enables users to access selected shared folders and their contents from different computers on a network.

  [discrete]
  ==== Rationale:
  Not allowing guests to connect to shared folders mitigates the risk of an untrusted user doing basic reconnaissance and possibly use privilege escalation attacks to take control of the system.

  [IMPORTANT]
  ====
  Unauthorized users could access shared files on the system.
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AllowGuestAccess = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85319-2
  800-53r4:
    - AC-2
    - AC-2(9)
  disa_stig:
    - N/A
  srg: 
    - N/A
  cci: 
    - N/A    
  800-171r2:
    - 3.5.1
    - 3.5.2
  custom:
    CIS:
    - 6.1.4 Disable "Allow guests to connect to shared folders" (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
mobileconfig: true
mobileconfig_info:
  com.apple.smb.server:
    AllowGuestAccess: false