id: useraccounts_disable_autorun_files_safari
title: "Disable the automatic run of safe files in Safari (Automated)"
discussion: |
  [discrete]
  ==== Description:
  Safari will automatically run or execute what it considers safe files. This can include installers and other files that execute on the operating system. Safari bases file safety by using a list of filetypes maintained by Apple. The list of files include text, image, video and archive formats that would be run in the context of the OS rather than the browser.

  [discrete]
  ==== Rationale:
  Hackers have taken advantage of this setting via drive-by attacks. These attacks occur when a user visits a legitimate website that has been corrupted. The user unknowingly downloads a malicious file either by closing an infected pop-up or hovering over a malicious banner. An attacker can create a malicious file that will fall within Safari's safe file list that will download and execute without user input.
  
  [IMPORTANT]
  ====
  Apple considers many files that the operating system itself auto-executes as "safe files." Many of these files could be malicious and could execute locally without the user even knowing that a file of a specific type had been download.
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AutoOpenSafeDownloads = false'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: 
    - N/A
  800-53r4:
    - N/A
  custom:
    CIS:
    - 6.3 Disable the automatic run of safe files in Safari (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    AutoOpenSafeDownloads: false
    

