id: useraccounts_password_hints_disable
title: 'Disable "Show password hints" (Automated)'
discussion: |
  [discrete]
  ==== Description:
  Password hints are user created text displayed when an incorrect password is used for an account.

  [discrete]
  ==== Rationale:
  Password hints make it easier for unauthorized persons to gain access to systems by providing information to anyone that the user provided to assist in remembering the password. This info could include the password itself or other information that might be readily discerned with basic knowledge of the end user.

  [IMPORTANT]
  ====
  The user can set the hint to any value including the password itself or clues that allow trivial social engineering attacks.
  ====

  [discrete]
  ==== Audit:
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'RetriesUntilHint = 0'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - CCE-85437-2
  cci:
    - CCI-000366
  800-53r4:
    - IA-6
  srg:
    - SRG-OS-000480-GPOS-00227
  disa_stig:
    - APPL-11-003012
  800-171r2:
    - 3.5.11
  custom:
    CIS:
    - 6.1.2 Disable "Show password hints" (Automated)
    - Level 1
macOS:
  - "11.0"
tags:
  - CIS-Benchmark
  - CIS-Benchmark-L1
severity: "medium"
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    RetriesUntilHint: 0